TDATA-009-FEAT(integratin): Update skills
